---
kind: type
id: T:Autodesk.Revit.UI.Mechanical.DuctFittingAndAccessoryPressureDropUIDataItem
source: html/21430cd5-52d1-fcae-d793-43fcef03dfdc.htm
---
# Autodesk.Revit.UI.Mechanical.DuctFittingAndAccessoryPressureDropUIDataItem

Each duct fitting or duct accessory FamilyInstance has one DuctFittingAndAccessoryPressureDropUIDataItem.

## Syntax (C#)
```csharp
public class DuctFittingAndAccessoryPressureDropUIDataItem : IDisposable
```

## Remarks
One family instance has one UI data item.
 The UI data item contains a corresponding DuctFittingAndAccessoryData which is used for initialing the UI settings and an entity which is used for storing the UI settings.